InformationRegisters/ДатыКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыКомплекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БезГабаритногоЧертежа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЗамера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГантКонструктораНачалоПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГантКонструктораНачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГантКонструктораОкончаниеПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГантКонструктораОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГОСТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейРКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейТЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорияКонструктора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Код_в_PDM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДоработка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерИзменение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКорректировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_ПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_РКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_ТЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РКД_отдельно_от_композиции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СогласованДизайнером</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокМонтажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПроектирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПроизводства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКомплекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКомплектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоДоработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоРекламация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ФормаОтправкаНесколькихЗначенийВ_ПДМ/Ext/Form/Module.bsl
&НаКлиенте
Перем ПутьКФайлуEXE, ПутьКФайлуЗагрузки, ТестКаталог;


Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипВыгрузки 			= Параметры.ТипВыгрузки;
	НаименованиеЭлемента 	= Параметры.НаименованиеЭлемента;
	НомерСтрокиВыгрузки 	= 1;
	НомерСтроки				= 1;
	
	Для каждого х Из Параметры.мДанныеЭлемента Цикл
		
		Если ПустаяСтрока(х.ID_PDM) Тогда
		
			Сообщить("Не все комплекты имеют коды PDM");
			ОшибкаЗагрузки = Истина;
			Прервать;
		
		КонецЕсли;
		
		НС 				= тзДанные.Добавить();
		НС.ID_PDM 		= Число(Формат(х.ID_PDM, "ЧГ=0"));	
		НС.UsrName 		= х.UsrName;
		НС.НомерСтроки 	= НомерСтроки;
		
		НомерСтроки = НомерСтроки + 1;
	
	КонецЦикла; 
	
	мОтображаемыеКолонки = Новый Массив;
	
	Если ТипВыгрузки = "РаздатьПрава" ИЛИ ТипВыгрузки = "ЗабратьПрава" Тогда     
		
		мОтображаемыеКолонки.Добавить("НомерСтроки");
		мОтображаемыеКолонки.Добавить("тзДанныеID_PDM");
		мОтображаемыеКолонки.Добавить("тзДанныеUsrName");
		мОтображаемыеКолонки.Добавить("тзДанныеРезультатВыгрузки");
		мОтображаемыеКолонки.Добавить("тзДанныеНаименованиеОбъекта");
		
		ЗаполнитьОъектыПриСоздании();
		
	Иначе
		
		
	КонецЕсли;	
	
	Для каждого текКолонка Из тзДанные.Выгрузить().Колонки Цикл     
		
		Если НЕ Элементы.Найти(текКолонка.Имя) = Неопределено Тогда
			
			Элементы[текКолонка.Имя].Видимость = ?(мОтображаемыеКолонки.Найти(текКолонка.Имя) = Неопределено, Ложь, Истина); 
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры 

Процедура ЗаполнитьОъектыПриСоздании()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыКомплекта.Комплект КАК ОбъектТЗ,
		|	ДатыКомплекта.Комплект.Наименование КАК НаименованиеОбъекта,
		|	ДатыКомплекта.Код_в_PDM КАК Код_в_PDM
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|ГДЕ
		|	ДатыКомплекта.Код_в_PDM В(&Код_в_PDM)";
	
	Запрос.УстановитьПараметр("Код_в_PDM", тзДанные.Выгрузить(, "ID_PDM").ВыгрузитьКолонку("ID_PDM"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	стОтбор = Новый Структура("ID_PDM", );
	
	Пока Выборка.Следующий() Цикл
		
		стОтбор.ID_PDM = Выборка.Код_в_PDM;
		
		НайденыеСтроки = тзДанные.НайтиСтроки(стОтбор);
		
		Если НайденыеСтроки.Количество() > 0 Тогда
		
			ЗаполнитьЗначенияСвойств(НайденыеСтроки[0], Выборка);	
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если тзДанные.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	Если ОшибкаЗагрузки Тогда
		Возврат;	
	КонецЕсли;
	
	стДанныеВыгрузки = омВыгрузкаCRMНаСевере.ПолучитьДанныеВыгрузки();
	
	ПутьКФайлуEXE = ом_ПДМ_на_клиенте.ПолучитьПутьКВыгузке(ТипВыгрузки, стДанныеВыгрузки);
	Если ПустаяСтрока(ПутьКФайлуEXE) Тогда       
		
		ТекущиеДействие = "Не заполнен путь к исполняемому файлу.";        
		
	КонецЕсли;
	
	ПутьКФайлуЗагрузки = стДанныеВыгрузки.ПутьКФайлуЗагрузки; 
	
	Если ПустаяСтрока(ПутьКФайлуЗагрузки) Тогда
		
		ТекущиеДействие = "Каталог выгрузки не заполнен.";
		Возврат;	
		
	КонецЕсли;
	
	ТестКаталог = Новый Файл(ПутьКФайлуЗагрузки); 
	
	Если НЕ ТестКаталог.Существует() Тогда
		
		ТекущиеДействие = "Каталог " + ПутьКФайлуЗагрузки + " не существует.";
		Возврат;	
		
	КонецЕсли;
	

	ВыгрузитьДанные();	
	
КонецПроцедуры 


&НаКлиенте
Процедура ВыгрузитьДанные()
	
	Если НомерСтрокиВыгрузки > тзДанные.Количество() Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	Если ТипВыгрузки = "РаздатьПрава" ИЛИ ТипВыгрузки = "ЗабратьПрава" Тогда     
		
		мДанныеЭлемента 	= Новый Массив; 
		мДанныеЭлемента.Добавить(Новый Структура("ID_PDM, UsrName", Формат(тзДанные[НомерСтрокиВыгрузки -1].ID_PDM, "ЧГ=0"), тзДанные[НомерСтрокиВыгрузки - 1].UsrName));
		
		ТекстДок = омВыгрузкаCRMНаКлиенте.СоздатьФайлВыгрузки(мДанныеЭлемента, ТипВыгрузки);
		
	КонецЕсли;
	

	Если ТипЗнч(ТекстДок) = Тип("Строка") Тогда
		ТекущиеДействие = ТекстДок;	
		Возврат;
	КонецЕсли;
	
	ИмяФайла = ТестКаталог.ПолноеИмя + "\" + НаименованиеЭлемента + ".csv";
	
	Попытка
		
		ТекстДок.Записать(ИмяФайла,,КодировкаТекста.UTF8);
		ТекущиеДействие = "Данные о " + тзДанные[НомерСтрокиВыгрузки -1].НаименованиеОбъекта + " выгружены в файл " + ИмяФайла;
		
		Если НЕ ПустаяСтрока(ПутьКФайлуEXE) Тогда
			
			стрОшибка = омВыгрузкаCRMНаКлиенте.ВыгрузитьФайлВPDM(ПутьКФайлуEXE);
			
			Если ПустаяСтрока(стрОшибка) Тогда
				
				ом_ПДМ_на_клиенте.УправлениеКонтроляВыгрузкиВPDM(Истина);
				
			Иначе
				
				ТекущиеДействие = стрОшибка;	
				
			КонецЕсли;
			
		КонецЕсли;
	Исключение
		ТекущиеДействие = "Не удалось сохранить выгрузку в файл " + ИмяФайла;
	КонецПопытки;
	
КонецПроцедуры // ВыгрузитьДанные()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	
	Если ИмяСобытия = "ИзменилсяНаборПравPDM" Тогда
		
		Если НомерСтрокиВыгрузки > тзДанные.Количество() Тогда
			
			Закрыть();
			Возврат;	
			
		КонецЕсли; 
		
		НомерСтрокиВыгрузки = НомерСтрокиВыгрузки + 1;
		Если ТипВыгрузки = "РаздатьПрава" ИЛИ ТипВыгрузки = "ЗабратьПрава" Тогда     
			
			стОтбор = Новый Структура("ID_PDM", Число(Параметр.КодЭлемента));
			НайденыеСтроки = тзДанные.НайтиСтроки(стОтбор);
			
			Если НайденыеСтроки.Количество() = 0 Тогда
				
				Возврат;	
				
			КонецЕсли;
			
			//Если Параметр.ЗначениеСуфикса = "0" Тогда
			//	
			//	ТекущиеДействие = "Не удалось назанчить права " + НайденыеСтроки[0].НаименованиеОбъекта;	
			//	
			//	Возврат;	
			//КонецЕсли;
			
			НайденыеСтроки[0].РезультатВыгрузки = Истина;
			
			мДанныеЭлемента 	= Новый Массив(1); 
			мДанныеЭлемента[0] 	= Новый Структура("ID_PDM, UsrName", Формат(тзДанные[НомерСтрокиВыгрузки -1].ID_PDM, "ЧГ=0"), тзДанные[НомерСтрокиВыгрузки - 1].UsrName);
			
			ТекстДок = омВыгрузкаCRMНаКлиенте.СоздатьФайлВыгрузки(мДанныеЭлемента, ТипВыгрузки);
			
			ИмяФайла = ТестКаталог.ПолноеИмя + "\" + НаименованиеЭлемента + ".csv";
			
			Попытка
				
				ТекстДок.Записать(ИмяФайла,,КодировкаТекста.UTF8);
				ТекущиеДействие = "Данные о " + тзДанные[НомерСтрокиВыгрузки -1].НаименованиеОбъекта + " выгружены в файл " + ИмяФайла;
				
				Если НЕ ПустаяСтрока(ПутьКФайлуEXE) Тогда
					
					стрОшибка = омВыгрузкаCRMНаКлиенте.ВыгрузитьФайлВPDM(ПутьКФайлуEXE);
					
					Если ПустаяСтрока(стрОшибка) Тогда
						
						ом_ПДМ_на_клиенте.УправлениеКонтроляВыгрузкиВPDM(Истина);
						НомерСтрокиВыгрузки = НомерСтрокиВыгрузки + 1;
						
					Иначе
						
						ТекущиеДействие = стрОшибка;	
						
					КонецЕсли;
					
				КонецЕсли;
				
			Исключение
				ТекущиеДействие = "Не удалось сохранить выгрузку в файл " + ИмяФайла;
			КонецПопытки; 
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
